RIET/src/InformationRegisters/StagesOfTripsNonLawsonCompaniesPeriodic/StagesOfTripsNonLawsonCompaniesPeriodic.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StagesOfTripsNonLawsonCompaniesPeriodic</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Stage</name>
    <type>
      <types>EnumRef.TripNonLawsonCompaniesStages</types>
    </type>
  </resources>
  <resources>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/StagesOfTripsNonLawsonCompanies/StagesOfTripsNonLawsonCompanies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StagesOfTripsNonLawsonCompanies</name>
  <resources>
    <name>Stage</name>
    <type>
      <types>EnumRef.TripNonLawsonCompaniesStages</types>
    </type>
  </resources>
  <resources>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/StagesOfTripsNonLawsonCompaniesPeriodic/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
					
		КлючЗаписи = Неопределено;
		
		Если НЕ ЗначениеЗаполнено(Запись.Trip) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Trip"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "Trip", "Запись", Отказ);			
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(Запись.Stage) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Stage"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "Stage", "Запись", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.ModificationDate) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Modification date"" is empty!",
				ПолучитьКлючЗаписи(Запись, КлючЗаписи), "ModificationDate", "Запись", Отказ);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКлючЗаписи(Запись, КлючЗаписи)
	
	Если КлючЗаписи = Неопределено Тогда
		СтруктураЗаписи = Новый Структура("Trip");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		КлючЗаписи = РегистрыСведений.StagesOfTripsNonLawsonCompanies.СоздатьКлючЗаписи(СтруктураЗаписи);
	КонецЕсли; 
		
	Возврат КлючЗаписи;
	
КонецФункции
